<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"d75b673aa2db3f03dce78e0874f73b73512fccd71794b4ae7151cdfa54aa147e","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1125 at https://github.com/cal-itp/data-infra/actions/runs/19917379553","plan_out_hash":"ee6e235f9673204b5028651fc65415a4096f67985567d4d932da7f5bf1d69ffb","plan_hash":"531862d1fbeac2b091064a8622a7d19bc4ff28644817660873780612671697aa","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 2 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/_src_gtfs_schedule_external_tables.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "JRuXXA==" -> (known after apply)
!~      detect_md5hash      = "Caqsk8kIhrzLrYxkwYo53g==" -> "different hash"
!~      generation          = 1751416666931203 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/_src_gtfs_schedule_external_tables.yml"
!~      md5hash             = "Caqsk8kIhrzLrYxkwYo53g==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/_src_gtfs_schedule_external_tables.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/_stg_gtfs.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "G4i6cQ==" -> (known after apply)
!~      detect_md5hash      = "ZIoZ9F+deaRCzQBuJSITkA==" -> "different hash"
!~      generation          = 1751416668944451 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/_stg_gtfs.yml"
!~      md5hash             = "ZIoZ9F+deaRCzQBuJSITkA==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/_stg_gtfs.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/stg_gtfs_schedule__download_configs.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/staging/gtfs/stg_gtfs_schedule__download_configs.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/staging/gtfs/stg_gtfs_schedule__download_configs.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-dags["seeds/gtfs_schedule_validator_rule_details_v0_0_0.csv"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/seeds/gtfs_schedule_validator_rule_details_v0_0_0.csv"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/seeds/gtfs_schedule_validator_rule_details_v0_0_0.csv"
+       storage_class  = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1125](https://github.com/cal-itp/data-infra/actions/runs/19917379553)